In [1]:
import sys

In [2]:
sys.version

'3.8.5 (default, Sep  4 2020, 02:22:02) \n[Clang 10.0.0 ]'

### Series

- 1차원 구조
- numpy 어레이와 마찬가지로 인덱스 이용이 가능하며, 인덱스를 지정할 수도 있다.

###### index가 따로일 때, 1,2,3,4라는 숫자 인덱스도 내포한다고 생각해볼 수 있다
###### loc, iloc 등에 사용된다

In [3]:
import numpy as np
import pandas as pd

In [4]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [6]:
for i in obj.index:
    print(i)

0
1
2
3

In [7]:
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])
print(obj2)
obj2.index

d    4
b    7
a   -5
c    3
dtype: int64

Index(['d', 'b', 'a', 'c'], dtype='object')

[시리즈 객체 인덱스 후 입력]

In [10]:
import string

In [11]:
string.ascii_lowercase

'abcdefghijklmnopqrstuvwxyz'

In [12]:
obj3 = obj.copy()

In [13]:
obj3.index = [i for i in string.ascii_lowercase[:4]]

In [14]:
obj3

a    4
b    7
c   -5
d    3
dtype: int64

In [15]:
print(obj2['a'])
print(obj2[2])

-5
-5

In [17]:
obj2[['c','a','d']] # numpy fancy index와 유사

c    3
a   -5
d    4
dtype: int64

In [19]:
# boolean indexing ; 트루값 찾음
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [20]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [23]:
# list 와의 차이는?

print(obj2 * 2)

print([1,2,3,4] * 2)

d     8
b    14
a   -10
c     6
dtype: int64
[1, 2, 3, 4, 1, 2, 3, 4]

In [24]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

<u><i>즉, 여기까지 연습해보고 유추할 수 있는 것은, 시리즈 객체 역시 리스트 객체와 마찬가지로 iterable하다는 것</i></u>

[연습] obj2 값에는 관심이 없고, 인덱스만 사용할 필요가 있을 때, 인덱스 번호를 리스트로

In [25]:
idx = [idx for idx, _ in enumerate(obj2)]

In [26]:
idx

[0, 1, 2, 3]

In [27]:
[val for val in obj2]

[4, 7, -5, 3]

In [28]:
test = [[idx, value] for idx,value in enumerate(obj2)]

In [29]:
test[0]

[0, 4]

In [31]:
values = [i[1] for i in test]
values

[4, 7, -5, 3]

[연습] obj2를 인덱스의 오름차순으로 정렬

In [43]:
# 오름차순
obj2.sort_index()

a   -5
b    7
c    3
d    4
dtype: int64

In [44]:
# 내림 - ascending=False
obj2.sort_index(ascending = False)

d    4
c    3
b    7
a   -5
dtype: int64

시리즈 객체는 일차원의 구조이므로, 딕셔너리 자료구조를 시리즈 객체로 변환하면 딕셔너리의 키는 행이름으로 사용된다.

In [33]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

In [35]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [36]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':[5000,6000]}
obj3 = pd.Series(sdata)
obj3

Ohio             35000
Texas            71000
Oregon           16000
Utah      [5000, 6000]
dtype: object

---

그렇다면 위 obj3는 숫자 연산이 될까?

In [39]:
obj3 + 3 # TypeError

TypeError: can only concatenate list (not "int") to list

In [40]:
obj3[0] + 1

35001

In [42]:
obj3[3] + 2 # TypeError

TypeError: can only concatenate list (not "int") to list

In [46]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

# 시리즈 객체 생성시 새로운 인덱스 ['California', 'Ohio', 'Oregon', 'Texas']를 지정

states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [47]:
print(pd.isnull(obj4))
print(pd.notnull(obj4))

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [48]:
obj4.name = 'population'
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [49]:
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [50]:
## 시리즈 행이름 변경/대체하기
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

---

### DataFrame

In [52]:
test = {'Name' : ['John', 'Anna', 'Peter'],
       'Location' : ['New York', 'Paris', 'Berlin'],
       'Age' : [24, 13, 45]}

In [53]:
type(test)

dict

In [54]:
test_pd = pd.DataFrame(test)
test_pd

    Name  Location  Age
0   John  New York   24
1   Anna     Paris   13
2  Peter    Berlin   45

Q) 나이가 15세 초과인 데이터만 행추출하고 싶다면? (filtering or subsetting)

In [55]:
test_pd['Name'] # indexing 방식

0     John
1     Anna
2    Peter
Name: Name, dtype: object

In [56]:
test_pd.Name # 속성 방식

0     John
1     Anna
2    Peter
Name: Name, dtype: object

In [57]:
test_pd.Age > 15

0     True
1    False
2     True
Name: Age, dtype: bool

In [58]:
test_pd[test_pd.Age > 15]

    Name  Location  Age
0   John  New York   24
2  Peter    Berlin   45

In [59]:
test_pd[['Name','Age']]
# 칼럼은 이와같은 방식으로 뽑아내기가 수월하다,
# 따라서 행 추출 연습이 필요하다.

    Name  Age
0   John   24
1   Anna   13
2  Peter   45

In [60]:
test_pd.loc[[0,2]]

    Name  Location  Age
0   John  New York   24
2  Peter    Berlin   45

In [61]:
test_pd.iloc[[0,2]]

    Name  Location  Age
0   John  New York   24
2  Peter    Berlin   45

Q) 나이가 15세 초과, 40세 미만인 데이터

In [62]:
test_pd[(test_pd.Age > 15) & (test_pd.Age < 40)] # 조건식 중첩

   Name  Location  Age
0  John  New York   24

---

#### 자료의 행수가 맞지 않을 때, 데이터프레임화?

In [63]:
test1 = {'Name' : ['John', 'Anna', 'Peter', 'Adam'],
        'Location' : ['New York', 'Paris', 'Berlin'],
        'Age' : [24, 13, 45]}

In [64]:
pd.DataFrame(test1)
## ValueError

ValueError: arrays must all be same length

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.from_dict.html

search : dict to dataframe

In [66]:
test_df1 = pd.DataFrame.from_dict(test1, orient = 'index')
test_df1

                 0      1       2     3
Name          John   Anna   Peter  Adam
Location  New York  Paris  Berlin  None
Age             24     13      45  None

In [70]:
test_df2 = test_df1.T
test_df2

    Name  Location   Age
0   John  New York    24
1   Anna     Paris    13
2  Peter    Berlin    45
3   Adam      None  None

In [69]:
pd.DataFrame(dict([(k, pd.Series(v)) for k, v in test1.items()]))

    Name  Location   Age
0   John  New York  24.0
1   Anna     Paris  13.0
2  Peter    Berlin  45.0
3   Adam       NaN   NaN

In [71]:
[(k, pd.Series(v)) for k, v in test1.items()]

[('Name',
  0     John
  1     Anna
  2    Peter
  3     Adam
  dtype: object),
 ('Location',
  0    New York
  1       Paris
  2      Berlin
  dtype: object),
 ('Age',
  0    24
  1    13
  2    45
  dtype: int64)]

In [68]:
test1.items()

dict_items([('Name', ['John', 'Anna', 'Peter', 'Adam']), ('Location', ['New York', 'Paris', 'Berlin']), ('Age', [24, 13, 45])])

## Pandas 기본 인덱싱

### 칼럼 추출
- 기본형 : 칼럼은 이름으로, 행은 행이름으로
- 그러나 행 추출의 경우 슬라이싱만 가능함

In [72]:
# 1개 칼럼 -> 시리즈

test_pd['Name']

0     John
1     Anna
2    Peter
Name: Name, dtype: object

In [73]:
test_pd['Name'][0] + '1' #시리즈라 리스트처럼 인덱싱 슬라이싱해서 이런게 가능하다.

'John1'

In [75]:
test_pd['Name'][[0,2]]

0     John
2    Peter
Name: Name, dtype: object

In [76]:
# 1개 칼럼 -> 데이터프레임으로

test_pd[['Name']]

    Name
0   John
1   Anna
2  Peter

In [77]:
# test_pd[['Name']][0] ; 인덱싱은 에러
test_pd[['Name']][:1] # ; 슬라이싱은 가능

   Name
0  John

In [79]:
test_pd[['Name']].loc[[0,2]] # loc ; 보여지는 행이름(인덱스)으로 꺼냄

    Name
0   John
2  Peter

In [80]:
test_pd1 = test_pd.copy()
test_pd1.index = ['a', 'b', 'c']
test_pd1

    Name  Location  Age
a   John  New York   24
b   Anna     Paris   13
c  Peter    Berlin   45

In [81]:
test_pd1.loc[['a']]             # loc는 보여지는 행이름, 즉 인덱스로 찾음

   Name  Location  Age
a  John  New York   24

In [84]:
test_pd1.iloc[[0,2]][['Name']]  # iloc는 숫자 행이름으로 찾음
# test_pd1.iloc[[0,2]]['Name']  # 시리즈로 반환

    Name
a   John
c  Peter

In [85]:
print(test_pd[['Name']])

    Name
0   John
1   Anna
2  Peter

In [86]:
for i in test_pd['Name']:
    print(i)

John
Anna
Peter

In [87]:
for i in test_pd[['Name']]:
    print(i)

Name

In [88]:
for i in test_pd[['Name']]['Name']:
    print(i)

John
Anna
Peter

In [92]:
# 데이터프레임 형태로 추출시, 슬라이싱만 가능
test_pd[['Name']][:1]

   Name
0  John

In [96]:
# 2개 칼럼 추출시, 리스트 형태로 전달
test_pd[['Name', 'Location']]
# test_pd['Name', 'Location'] ; 시리즈 형태로 추출, error발생

    Name  Location
0   John  New York
1   Anna     Paris
2  Peter    Berlin

In [97]:
test_pd[['Name', 'Location']][:2]

   Name  Location
0  John  New York
1  Anna     Paris

#### 더 연습해보기

In [98]:
data = {'state' : ['Ohio']*3 + ['Nevada']*3,
       'year' : [2000, 2001, 2002, 2001, 2002, 2003],
       'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [99]:
frame.tail(3)

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [100]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [101]:
# 데이터프레임의 기본정보 보기
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   6 non-null      object
 1   year    6 non-null      int64
 2   pop     6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 272.0+ bytes

In [103]:
# 데이터프레임의 기본통계량 보기
frame.describe()

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.550000
std       1.048809  0.836062
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  3.125000
max    2003.000000  3.600000

In [105]:
frame.describe().loc['std']
# describe() 통계량도 데이터프레임 형태, loc로 추출 가능

year    1.048809
pop     0.836062
Name: std, dtype: float64

In [106]:
# 칼럼 순서 변경
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [107]:
frame_test = frame[['year', 'pop', 'state']]
frame_test

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [110]:
# 없는 칼럼 추가
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [111]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [112]:
# 한 개 칼럼 추출 (Series객체로)
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [113]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [115]:
frame2.state.six

'Nevada'

In [116]:
frame2['state']['six']

'Nevada'

In [114]:
# 한 개 칼럼 추출 (dataframe 객체로)
frame2[['state']]

        state
one      Ohio
two      Ohio
three    Ohio
four   Nevada
five   Nevada
six    Nevada

In [124]:
# 2개 칼럼 추출 -> 리스트로 전달,
# 추출 후 특정 행 subsetting -> 슬라이싱만 허용(인덱싱 불가)

frame2[['year', 'state']]

       year   state
one    2000    Ohio
two    2001    Ohio
three  2002    Ohio
four   2001  Nevada
five   2002  Nevada
six    2003  Nevada

In [125]:
frame2[['year', 'state']][:2]

     year state
one  2000  Ohio
two  2001  Ohio

## 특정 칼럼에 값 넣기

In [141]:
frame2['debt'] = 16.5

## 특정 칼럼 추가

In [142]:
frame2['debt/pop'] = frame2['debt']/frame2['pop']
frame2

       year   state  pop  debt   debt/pop  debt/pop*100  etc
one    2000    Ohio  1.5  16.5  11.000000   1100.000000   50
two    2001    Ohio  1.7  16.5   9.705882    970.588235   50
three  2002    Ohio  3.6  16.5   4.583333    458.333333   50
four   2001  Nevada  2.4  16.5   6.875000    687.500000   50
five   2002  Nevada  2.9  16.5   5.689655    568.965517   50
six    2003  Nevada  3.2  16.5   5.156250    515.625000   50

In [143]:
frame2['debt/pop*100'] = frame2['debt/pop']*100
frame2

       year   state  pop  debt   debt/pop  debt/pop*100  etc
one    2000    Ohio  1.5  16.5  11.000000   1100.000000   50
two    2001    Ohio  1.7  16.5   9.705882    970.588235   50
three  2002    Ohio  3.6  16.5   4.583333    458.333333   50
four   2001  Nevada  2.4  16.5   6.875000    687.500000   50
five   2002  Nevada  2.9  16.5   5.689655    568.965517   50
six    2003  Nevada  3.2  16.5   5.156250    515.625000   50

In [144]:
# null값으로 칼럼 추가
frame2['etc'] = np.NaN
frame2

       year   state  pop  debt   debt/pop  debt/pop*100  etc
one    2000    Ohio  1.5  16.5  11.000000   1100.000000  NaN
two    2001    Ohio  1.7  16.5   9.705882    970.588235  NaN
three  2002    Ohio  3.6  16.5   4.583333    458.333333  NaN
four   2001  Nevada  2.4  16.5   6.875000    687.500000  NaN
five   2002  Nevada  2.9  16.5   5.689655    568.965517  NaN
six    2003  Nevada  3.2  16.5   5.156250    515.625000  NaN

In [145]:
# null 확인
pd.isnull(frame2['etc'])

one      True
two      True
three    True
four     True
five     True
six      True
Name: etc, dtype: bool

In [146]:
pd.isna(frame2['etc'])

one      True
two      True
three    True
four     True
five     True
six      True
Name: etc, dtype: bool

In [147]:
# 1개의 값으로 채워넣기
frame2['etc'] = 50
frame2

       year   state  pop  debt   debt/pop  debt/pop*100  etc
one    2000    Ohio  1.5  16.5  11.000000   1100.000000   50
two    2001    Ohio  1.7  16.5   9.705882    970.588235   50
three  2002    Ohio  3.6  16.5   4.583333    458.333333   50
four   2001  Nevada  2.4  16.5   6.875000    687.500000   50
five   2002  Nevada  2.9  16.5   5.689655    568.965517   50
six    2003  Nevada  3.2  16.5   5.156250    515.625000   50

In [148]:
# 서로 다른 값으로 채워넣기 -> 행 수에 맞는 리스트로 추가
# 즉, 행 갯수 같은 리스트로 특정 칼럼 대체 가능하다는 뜻
frame2['etc2'] = np.NaN

frame2['etc2'] = [i for i in range(12) if i%2 == 0]
frame2

       year   state  pop  debt   debt/pop  debt/pop*100  etc  etc2
one    2000    Ohio  1.5  16.5  11.000000   1100.000000   50     0
two    2001    Ohio  1.7  16.5   9.705882    970.588235   50     2
three  2002    Ohio  3.6  16.5   4.583333    458.333333   50     4
four   2001  Nevada  2.4  16.5   6.875000    687.500000   50     6
five   2002  Nevada  2.9  16.5   5.689655    568.965517   50     8
six    2003  Nevada  3.2  16.5   5.156250    515.625000   50    10

In [149]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt   debt/pop  debt/pop*100  etc  etc2
one    2000    Ohio  1.5   0.0  11.000000   1100.000000   50     0
two    2001    Ohio  1.7   1.0   9.705882    970.588235   50     2
three  2002    Ohio  3.6   2.0   4.583333    458.333333   50     4
four   2001  Nevada  2.4   3.0   6.875000    687.500000   50     6
five   2002  Nevada  2.9   4.0   5.689655    568.965517   50     8
six    2003  Nevada  3.2   5.0   5.156250    515.625000   50    10

In [150]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [151]:
frame2['debt'] = val
frame2
# 인덱스에 맞춰서 들어가니, 없는 것들은 nan이 된다.

       year   state  pop  debt   debt/pop  debt/pop*100  etc  etc2
one    2000    Ohio  1.5   NaN  11.000000   1100.000000   50     0
two    2001    Ohio  1.7  -1.2   9.705882    970.588235   50     2
three  2002    Ohio  3.6   NaN   4.583333    458.333333   50     4
four   2001  Nevada  2.4  -1.5   6.875000    687.500000   50     6
five   2002  Nevada  2.9  -1.7   5.689655    568.965517   50     8
six    2003  Nevada  3.2   NaN   5.156250    515.625000   50    10

In [152]:
frame2.head(2)

     year state  pop  debt   debt/pop  debt/pop*100  etc  etc2
one  2000  Ohio  1.5   NaN  11.000000   1100.000000   50     0
two  2001  Ohio  1.7  -1.2   9.705882    970.588235   50     2

In [153]:
frame2.drop('one').head(2)
# default axis = 0 ; 행. 따라서 행 이름으로 삭제
# axis = 1 은 칼럼 이름으로 삭제
# inplace = True 넣어야 반영 (default inplace = False)

       year state  pop  debt  debt/pop  debt/pop*100  etc  etc2
two    2001  Ohio  1.7  -1.2  9.705882    970.588235   50     2
three  2002  Ohio  3.6   NaN  4.583333    458.333333   50     4

In [154]:
frame2.drop(['etc', 'etc2'], axis = 1)

       year   state  pop  debt   debt/pop  debt/pop*100
one    2000    Ohio  1.5   NaN  11.000000   1100.000000
two    2001    Ohio  1.7  -1.2   9.705882    970.588235
three  2002    Ohio  3.6   NaN   4.583333    458.333333
four   2001  Nevada  2.4  -1.5   6.875000    687.500000
five   2002  Nevada  2.9  -1.7   5.689655    568.965517
six    2003  Nevada  3.2   NaN   5.156250    515.625000

In [155]:
frame2.reset_index(drop = True)

   year   state  pop  debt   debt/pop  debt/pop*100  etc  etc2
0  2000    Ohio  1.5   NaN  11.000000   1100.000000   50     0
1  2001    Ohio  1.7  -1.2   9.705882    970.588235   50     2
2  2002    Ohio  3.6   NaN   4.583333    458.333333   50     4
3  2001  Nevada  2.4  -1.5   6.875000    687.500000   50     6
4  2002  Nevada  2.9  -1.7   5.689655    568.965517   50     8
5  2003  Nevada  3.2   NaN   5.156250    515.625000   50    10

In [156]:
frame2.loc['two']

year               2001
state              Ohio
pop                 1.7
debt               -1.2
debt/pop        9.70588
debt/pop*100    970.588
etc                  50
etc2                  2
Name: two, dtype: object

In [157]:
frame2.iloc[1]

year               2001
state              Ohio
pop                 1.7
debt               -1.2
debt/pop        9.70588
debt/pop*100    970.588
etc                  50
etc2                  2
Name: two, dtype: object

In [158]:
# 논리값 채워넣기
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt   debt/pop  debt/pop*100  etc  etc2  eastern
one    2000    Ohio  1.5   NaN  11.000000   1100.000000   50     0     True
two    2001    Ohio  1.7  -1.2   9.705882    970.588235   50     2     True
three  2002    Ohio  3.6   NaN   4.583333    458.333333   50     4     True
four   2001  Nevada  2.4  -1.5   6.875000    687.500000   50     6    False
five   2002  Nevada  2.9  -1.7   5.689655    568.965517   50     8    False
six    2003  Nevada  3.2   NaN   5.156250    515.625000   50    10    False

## 연습문제

월드뱅크 gdp 데이터를 이용, 아래 문제에 해당하는 데이터를 추출해보세요

결과만 데이터 프레임 형태로 확인할 수 있으면 됩니다

0. Ranking 칼럼 추가

1. 상위 5개국 국가 코드명과 랭킹 칼럼

2. 중국 일본 한국의 랭킹과 gdp 칼럼

3. 랭킹이 홀수인 국가들의 코드, 랭킹, gdp 칼럼

4. 랭킹이 짝수이면서 10위 이내 국가들의 코드 랭킹 gdp 칼럼

In [162]:
A = pd.read_csv('gdp2018_1.csv', sep = ';')
A['GDP'] = [int(g.replace(",","")) for g in A['GDP']]
A

   Code              Nation       GDP
0   GBR      United Kingdom   3074432
1   JPN               Japan   5484951
2   IND               India  10498468
3   USA       United States  20494100
4   RUS  Russian Federation   3986064
5   KOR          Korea Rep.   2090161
6   FRA              France   3073179
7   ITA               Italy   2542974
8   AUS           Australia   1288228
9   TUR              Turkey   2372087
10  DEU             Germany   4505236
11  MEX              Mexico   2519962
12  THA            Thailand   1320373
13  SAU        Saudi Arabia   1857538
14  IRN   Iran Islamic Rep.   1695064
15  CHN               China  25361744
16  IDN           Indonesia   3494762
17  ESP               Spain   1908879
18  BRA              Brazil   3365757
19  CAN              Canada   1774034

---

In [163]:
A_0 = A.sort_values('GDP', ascending = False)
A_0['Ranking'] = list(np.arange(1,21))
A_0

   Code              Nation       GDP  Ranking
15  CHN               China  25361744        1
3   USA       United States  20494100        2
2   IND               India  10498468        3
1   JPN               Japan   5484951        4
10  DEU             Germany   4505236        5
4   RUS  Russian Federation   3986064        6
16  IDN           Indonesia   3494762        7
18  BRA              Brazil   3365757        8
0   GBR      United Kingdom   3074432        9
6   FRA              France   3073179       10
7   ITA               Italy   2542974       11
11  MEX              Mexico   2519962       12
9   TUR              Turkey   2372087       13
5   KOR          Korea Rep.   2090161       14
17  ESP               Spain   1908879       15
13  SAU        Saudi Arabia   1857538       16
19  CAN              Canada   1774034       17
14  IRN   Iran Islamic Rep.   1695064       18
12  THA            Thailand   1320373       19
8   AUS           Australia   1288228       20

---

In [166]:
A_1_1 = A_0[:5][['Code','Ranking']]
A_1_1

   Code  Ranking
15  CHN        1
3   USA        2
2   IND        3
1   JPN        4
10  DEU        5

In [168]:
A_1_2 = A_0.iloc[:5, [0,3]]
A_1_2

   Code  Ranking
15  CHN        1
3   USA        2
2   IND        3
1   JPN        4
10  DEU        5

In [170]:
A_1_3 = A_0.head(5)[['Code','Ranking']]
A_1_3

   Code  Ranking
15  CHN        1
3   USA        2
2   IND        3
1   JPN        4
10  DEU        5

---

In [174]:
A_0[(A_0.Code == 'CHN') | (A_0.Code == 'JPN') | (A_0.Code == 'KOR')][['Code', 'Ranking', 'GDP']]

   Code  Ranking       GDP
15  CHN        1  25361744
1   JPN        4   5484951
5   KOR       14   2090161

In [175]:
A_0.loc[A_0.Code.isin(['CHN','JPN','KOR']), ['Code', 'Ranking', 'GDP']]

   Code  Ranking       GDP
15  CHN        1  25361744
1   JPN        4   5484951
5   KOR       14   2090161

---

In [176]:
A_0[(A_0.Ranking % 2) != 0][['Code', 'Ranking', 'GDP']]

   Code  Ranking       GDP
15  CHN        1  25361744
2   IND        3  10498468
10  DEU        5   4505236
16  IDN        7   3494762
0   GBR        9   3074432
7   ITA       11   2542974
9   TUR       13   2372087
17  ESP       15   1908879
19  CAN       17   1774034
12  THA       19   1320373

---

In [178]:
A_0[((A_0.Ranking % 2) == 0) & (A_0.Ranking <= 10)][['Code', 'Ranking', 'GDP']]

   Code  Ranking       GDP
3   USA        2  20494100
1   JPN        4   5484951
4   RUS        6   3986064
18  BRA        8   3365757
6   FRA       10   3073179